package homework2;

public class Homework2_3 {
    public static void main(String[] args) {
        /* Составьте программу, выводящую на экран квадраты чисел от 10 до 20 включительно.*/

        for (int n = 10; n <= 20; n++) {
            System.out.println((int) Math.pow(n, 2));
        }
    }
}
